In [1]:
from sqlalchemy import create_engine
import psycopg2 as pg
import pandas as pd

In [2]:
db_string = "postgresql://wbauer_adb:adb2020@pgsql-196447.vipserv.org:5432/wbauer_adb"

db = create_engine(db_string)

connection_sqlalchemy = db.connect()

connection = pg.connect(host='pgsql-196447.vipserv.org', port=5432, dbname='wbauer_adb', \
                        user='wbauer_adb', password='adb2020')

### Ćwiczenie 1

In [3]:
df = pd.read_sql('SELECT COUNT(name) AS Liczba_filmow_w_wypozyczalni FROM category',con=connection_sqlalchemy)
print(df)

   liczba_filmow_w_wypozyczalni
0                            16

### Ćwiczenie 2

In [4]:
df = pd.read_sql('SELECT name AS lista_kategorii_alfabetycznie FROM category ORDER BY name ASC',con=connection_sqlalchemy)
print(df)

   lista_kategorii_alfabetycznie
0                         Action
1                      Animation
2                       Children
3                       Classics
4                         Comedy
5                    Documentary
6                          Drama
7                         Family
8                        Foreign
9                          Games
10                        Horror
11                         Music
12                           New
13                        Sci-Fi
14                        Sports
15                        Travel

### Ćwiczenie 3

In [5]:
df = pd.read_sql('SELECT title AS Najstarszy_film FROM film ORDER BY release_year DESC LIMIT 1', con=connection_sqlalchemy)
print(df)
df = pd.read_sql('SELECT title AS Najmlodszy_film FROM film ORDER BY release_year ASC LIMIT 1', con=connection_sqlalchemy)
print(df)
# komentarz:
# To zapytanie nie działa właściwie, gdyż wszystkie filmy są z 2006 roku, więc wybranie 
# najstarszego i najmłodszego zależy od zastosowanego sortowania wyników

   najstarszy_film
0  Chamber Italian
   najmlodszy_film
0  Chamber Italian

### Ćwiczenie 4

In [6]:
result_set = db.execute("SELECT COUNT(*) FROM rental WHERE rental_date BETWEEN '2005-07-01' AND '2005-08-01'")
print('Liczba wypożyczeń w okresie 2005 07 01 - 2005 08 01')
for r in result_set:
    print(r)

Liczba wypożyczeń w okresie 2005 07 01 - 2005 08 01
(6709,)

### Ćwiczenie 5

In [7]:
result_set = db.execute("SELECT COUNT(*) FROM rental WHERE rental_date BETWEEN '2010-01-01' AND '2010-02-01'")
print('Liczba wypożyczeń w okresie 2010 07 01 - 2010 08 01')
for r in result_set:
    print(r)

Liczba wypożyczeń w okresie 2010 07 01 - 2010 08 01
(0,)

### Ćwiczenie 6

In [8]:
df = pd.read_sql('SELECT MAX(amount) AS Najwieksza_platnosc_wypozyczenia FROM payment',con=connection_sqlalchemy)
print(df)

   najwieksza_platnosc_wypozyczenia
0                             11.99

### Ćwiczenie 7

In [9]:
df = pd.read_sql("SELECT country.country ,customer.first_name, customer.last_name, customer.customer_id \
                from country, city, address, customer \
                WHERE country.country IN ('Poland','Nigeria','Bangladesh') \
                AND country.country_id = city.country_id \
                AND address.city_id = city.city_id \
                AND customer.address_id=address.address_id",con=connection_sqlalchemy)
print(df)

       country first_name  last_name  customer_id
0      Nigeria      Sonia    Gregory          284
1       Poland      Brian      Wyman          318
2       Poland     Sidney   Burleson          572
3      Nigeria     Rodney    Moeller          409
4   Bangladesh    Stephen     Qualls          332
5      Nigeria      Velma      Lucas          286
6      Nigeria    Marilyn       Ross           80
7      Nigeria      Elsie     Kelley          198
8      Nigeria     Gladys   Hamilton          103
9   Bangladesh      Frank   Waggoner          329
10      Poland   Marjorie     Tucker          128
11     Nigeria      Carol     Garcia           18
12      Poland       Leah     Curtis          270
13      Poland      Ruben      Geary          501
14     Nigeria       Olga    Jimenez          277
15     Nigeria     Bertha   Ferguson          156
16     Nigeria     Tracey    Barrett          280
17     Nigeria         Jo     Fowler          250
18      Poland    Johnnie   Chisholm          571
19     Nigeria    Wallace      Slone          562
20  Bangladesh   Michelle      Clark           21
21      Poland    Russell    Brinson          380
22      Poland     Jimmie  Eggleston          558
23     Nigeria  Constance       Reid          232

### Ćwiczenie 8

In [10]:
df = pd.read_sql('SELECT staff.first_name, staff.last_name, city.city, country.country \
                FROM address, staff, city, country \
                WHERE staff.address_id = address.address_id \
                AND city.city_id = address.city_id \
                AND country.country_id = city.country_id',con=connection_sqlalchemy)
print('Członkowie personelu mieszkają w:')
print(df)

Członkowie personelu mieszkają w:
  first_name last_name        city    country
0       Mike   Hillyer  Lethbridge     Canada
1        Jon  Stephens   Woodridge  Australia

### Ćwiczenie 9

In [11]:
df = pd.read_sql("SELECT COUNT(staff) AS Liczba_pracownikow_z_Argentyny_lub_Hiszpanii \
                FROM address, staff, city, country \
                WHERE staff.address_id = address.address_id \
                AND city.city_id = address.city_id \
                AND country.country_id=city.country_id \
                AND country.country IN ('Spanish','Argentina')",con=connection_sqlalchemy)
print(df)

   liczba_pracownikow_z_argentyny_lub_hiszpanii
0                                             0

### Ćwiczenie 10

In [12]:
df = pd.read_sql("SELECT category AS kategorie_filmow_wypozyczane_przez_klientow \
                 FROM sales_by_film_category \
                 WHERE total_sales > 0",con=connection_sqlalchemy)
print(df)

   kategorie_filmow_wypozyczane_przez_klientow
0                                       Sports
1                                       Sci-Fi
2                                    Animation
3                                        Drama
4                                       Comedy
5                                          New
6                                       Action
7                                      Foreign
8                                        Games
9                                       Family
10                                 Documentary
11                                      Horror
12                                    Classics
13                                    Children
14                                      Travel
15                                       Music

### Ćwiczenie 11

In [14]:
df = pd.read_sql("SELECT distinct category.name AS kategorie_filmow_wypozyczonych_w_Ameryce \
            FROM category, film_category, inventory, rental, customer, address, city, country \
            WHERE category.category_id=film_category.category_id \
            AND film_category.film_id=inventory.film_id \
            AND inventory.inventory_id=rental.inventory_id \
            AND rental.customer_id=customer.customer_id \
            AND customer.address_id=address.address_id \
            AND address.city_id=city.city_id \
            AND city.country_id=country.country_id \
            AND country.country in ('United States')",con=connection_sqlalchemy)
print(df)

           name
0        Sports
1      Classics
2           New
3        Family
4        Comedy
5     Animation
6        Travel
7         Music
8         Drama
9        Horror
10       Sci-Fi
11        Games
12  Documentary
13      Foreign
14       Action
15     Children

### Ćwiczenie 12

In [25]:
pd.set_option('display.max_rows', None)
df = pd.read_sql("SELECT film.title, actor.first_name, actor.last_name \
                FROM film \
                INNER JOIN film_actor ON film.film_id=film_actor.film_id \
                INNER JOIN actor ON film_actor.actor_id=actor.actor_id \
                WHERE (actor.first_name = 'Olympia' AND actor.last_name = 'Pfeiffer') \
                OR  (actor.first_name = 'Julia' AND actor.last_name = 'Zellweger') \
                OR  (actor.first_name = 'Ellen' AND actor.last_name = 'Presley')",con=connection_sqlalchemy)
print('Wszystkie tytuły filmów w których grali Olympia Pfeiffer')
print('lub Jilia Zellweger lub Ellen Presley')
print(df)

Wszystkie tytuły filmów w których grali Olympia Pfeiffer
lub Jilia Zellweger lub Ellen Presley
                     title first_name  last_name
0          Bilko Anonymous      Ellen    Presley
1        Caribbean Liberty      Ellen    Presley
2         Casper Dragonfly      Ellen    Presley
3         Empire Malkovich      Ellen    Presley
4            Floats Garden      Ellen    Presley
5         Frogmen Breaking      Ellen    Presley
6           Homeward Cider      Ellen    Presley
7              Hyde Doctor      Ellen    Presley
8           Image Princess      Ellen    Presley
9            Jacket Frisco      Ellen    Presley
10    Microcosmos Paradise      Ellen    Presley
11            Network Peak      Ellen    Presley
12              Oscar Gold      Ellen    Presley
13          Pickup Driving      Ellen    Presley
14         Pinocchio Simon      Ellen    Presley
15            Private Drop      Ellen    Presley
16          Roots Remember      Ellen    Presley
17           Scarface Bang      Ellen    Presley
18         Secretary Rouge      Ellen    Presley
19                Spy Mile      Ellen    Presley
20    Streetcar Intentions      Ellen    Presley
21            Tadpole Park      Ellen    Presley
22        Treasure Command      Ellen    Presley
23               Turn Star      Ellen    Presley
24            Women Dorado      Ellen    Presley
25             Badman Dawn    Olympia   Pfeiffer
26             Chitty Lock    Olympia   Pfeiffer
27      Color Philadelphia    Olympia   Pfeiffer
28       Contact Anonymous    Olympia   Pfeiffer
29            Deep Crusade    Olympia   Pfeiffer
30        Effect Gladiator    Olympia   Pfeiffer
31          Express Lonely    Olympia   Pfeiffer
32       Firehouse Vietnam    Olympia   Pfeiffer
33        Fugitive Maguire    Olympia   Pfeiffer
34           Hanky October    Olympia   Pfeiffer
35            Ice Crossing    Olympia   Pfeiffer
36         Idols Snatchers    Olympia   Pfeiffer
37  Intolerable Intentions    Olympia   Pfeiffer
38      Magnolia Forrester    Olympia   Pfeiffer
39              Mars Roman    Olympia   Pfeiffer
40               Maude Mod    Olympia   Pfeiffer
41        Murder Antitrust    Olympia   Pfeiffer
42            None Spiking    Olympia   Pfeiffer
43             Others Soup    Olympia   Pfeiffer
44           Psycho Shrunk    Olympia   Pfeiffer
45             Santa Paris    Olympia   Pfeiffer
46             Sense Greek    Olympia   Pfeiffer
47         Storm Happiness    Olympia   Pfeiffer
48       Sweet Brotherhood    Olympia   Pfeiffer
49        Titanic Boondock    Olympia   Pfeiffer
50         Tourist Pelican    Olympia   Pfeiffer
51          Traffic Hobbit    Olympia   Pfeiffer
52              Wait Cider    Olympia   Pfeiffer
53    Breakfast Goldfinger      Julia  Zellweger
54        Cranes Reservoir      Julia  Zellweger
55             Dares Pluto      Julia  Zellweger
56        Detective Vision      Julia  Zellweger
57         Divorce Shining      Julia  Zellweger
58         Hollow Jeopardy      Julia  Zellweger
59         Jeopardy Encino      Julia  Zellweger
60        Lambs Cincinatti      Julia  Zellweger
61         Majestic Floats      Julia  Zellweger
62            Minds Truman      Julia  Zellweger
63            Open African      Julia  Zellweger
64            Outlaw Hanky      Julia  Zellweger
65         Panky Submarine      Julia  Zellweger
66        Rider Caddyshack      Julia  Zellweger
67               Won Dares      Julia  Zellweger
68           Wyoming Storm      Julia  Zellweger